#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers/runs/run-psN6xxMj6Gn2RPMe

Waiting for the plan to start...

Terraform v1.0.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
github_repository.repos_cdktfprovidernull_repo_8A692B1D: Refreshing state... [id=cdktf-provider-null]
github_repository.repos_cdktfprovidergoogle_repo_3D7769E0: Refreshing state... [id=cdktf-provider-google]
github_repository.repos_cdktfproviderazurerm_repo_19E06DC3: Refreshing state... [id=cdktf-provider-azurerm]
github_repository.repos_cdktfproviderdatadog_repo_3C8DEE00: Refreshing state... [id=cdktf-provider-datadog]
github_repository.repos_cdktfproviderexternal_repo_2177D259: Refreshing state... [id=cdktf-provider-external]
github_repository.repos_cdktfrepositorymanager_repo_9D19EE52: Refreshing state... [id=cdktf-repository-manager]
github_repository.repos_cdktfprovidergithub_repo_66B8E54A: Refreshing state... [id=cdktf-provider-github]
github_repository.repos_cdktfproviderdocker_repo_45A47809: Refreshing state... [id=cdktf-provider-docker]
github_repository.repos_cdktfproviderrandom_repo_448077DE: Refreshing state... [id=cdktf-provider-random]
github_repository.repos_cdktfprovideraws_repo_55F46B23: Refreshing state... [id=cdktf-provider-aws]
github_repository.repos_cdktfproviderproject_repo_014C3CE2: Refreshing state... [id=cdktf-provider-project]
github_repository.repos_cdktfproviderkubernetes_repo_D69C3A79: Refreshing state... [id=cdktf-provider-kubernetes]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3namenugetapikey_6D07722B: Refreshing state... [id=cdktf-provider-azurerm:NUGET_API_KEY]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3namenpmtoken_2DA48D9F: Refreshing state... [id=cdktf-provider-azurerm:NPM_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3nametwinepassword_8154E2FB: Refreshing state... [id=cdktf-provider-azurerm:TWINE_PASSWORD]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3nametwineusername_049CB040: Refreshing state... [id=cdktf-provider-azurerm:TWINE_USERNAME]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3nameghtoken_1ECFC94A: Refreshing state... [id=cdktf-provider-azurerm:GH_TOKEN]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0nameghtoken_A7BAAE81: Refreshing state... [id=cdktf-provider-google:GH_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0nametwinepassword_6AF1BFAC: Refreshing state... [id=cdktf-provider-google:TWINE_PASSWORD]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0nametwineusername_095BADA0: Refreshing state... [id=cdktf-provider-google:TWINE_USERNAME]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0namenpmtoken_FA80209B: Refreshing state... [id=cdktf-provider-google:NPM_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0namenugetapikey_5A6D8D97: Refreshing state... [id=cdktf-provider-google:NUGET_API_KEY]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00nametwineusername_5D9D084F: Refreshing state... [id=cdktf-provider-datadog:TWINE_USERNAME]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00nametwinepassword_1A05B3D4: Refreshing state... [id=cdktf-provider-datadog:TWINE_PASSWORD]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00nameghtoken_ADF9D40A: Refreshing state... [id=cdktf-provider-datadog:GH_TOKEN]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00namenpmtoken_37AC08DB: Refreshing state... [id=cdktf-provider-datadog:NPM_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00namenugetapikey_89F31AB3: Refreshing state... [id=cdktf-provider-datadog:NUGET_API_KEY]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259nameghtoken_CD932FAF: Refreshing state... [id=cdktf-provider-external:GH_TOKEN]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259namenpmtoken_34906B46: Refreshing state... [id=cdktf-provider-external:NPM_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259nametwinepassword_6A27C028: Refreshing state... [id=cdktf-provider-external:TWINE_PASSWORD]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259nametwineusername_464237BB: Refreshing state... [id=cdktf-provider-external:TWINE_USERNAME]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259namenugetapikey_EBF89198: Refreshing state... [id=cdktf-provider-external:NUGET_API_KEY]
github_actions_secret.repos_ghcommenttoken_secretgithubrepositoryreposcdktfrepositorymanagerrepo9D19EE52nameghcommenttoken_CD3F9953: Refreshing state... [id=cdktf-repository-manager:GH_COMMENT_TOKEN]
github_actions_secret.repos_tfcloudtoken_secretgithubrepositoryreposcdktfrepositorymanagerrepo9D19EE52nametfcloudtoken_5D4B526C: Refreshing state... [id=cdktf-repository-manager:TF_CLOUD_TOKEN]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anametwineusername_6943A63C: Refreshing state... [id=cdktf-provider-github:TWINE_USERNAME]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anamenpmtoken_9B4FF3AD: Refreshing state... [id=cdktf-provider-github:NPM_TOKEN]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anameghtoken_6E9D5372: Refreshing state... [id=cdktf-provider-github:GH_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anametwinepassword_1DCE070B: Refreshing state... [id=cdktf-provider-github:TWINE_PASSWORD]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anamenugetapikey_795BC233: Refreshing state... [id=cdktf-provider-github:NUGET_API_KEY]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnameghtoken_E575EEAE: Refreshing state... [id=cdktf-provider-null:GH_TOKEN]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnamenpmtoken_5CD80167: Refreshing state... [id=cdktf-provider-null:NPM_TOKEN]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnametwineusername_4D61E54C: Refreshing state... [id=cdktf-provider-null:TWINE_USERNAME]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnamenugetapikey_369EDCA6: Refreshing state... [id=cdktf-provider-null:NUGET_API_KEY]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnametwinepassword_1CAAF676: Refreshing state... [id=cdktf-provider-null:TWINE_PASSWORD]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809namenugetapikey_67D8E3E2: Refreshing state... [id=cdktf-provider-docker:NUGET_API_KEY]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809nametwinepassword_4BEABCCF: Refreshing state... [id=cdktf-provider-docker:TWINE_PASSWORD]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809namenpmtoken_4DC2E01F: Refreshing state... [id=cdktf-provider-docker:NPM_TOKEN]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809nameghtoken_1CA966DB: Refreshing state... [id=cdktf-provider-docker:GH_TOKEN]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809nametwineusername_FB1AFDA6: Refreshing state... [id=cdktf-provider-docker:TWINE_USERNAME]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnamenugetapikey_4B72CF6A: Refreshing state... [id=cdktf-provider-random:NUGET_API_KEY]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnameghtoken_4BBD15CB: Refreshing state... [id=cdktf-provider-random:GH_TOKEN]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnamenpmtoken_AFDB0F2B: Refreshing state... [id=cdktf-provider-random:NPM_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnametwinepassword_12957BC9: Refreshing state... [id=cdktf-provider-random:TWINE_PASSWORD]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnametwineusername_E790E307: Refreshing state... [id=cdktf-provider-random:TWINE_USERNAME]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23nametwineusername_2FD08746: Refreshing state... [id=cdktf-provider-aws:TWINE_USERNAME]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23namenpmtoken_DEA38761: Refreshing state... [id=cdktf-provider-aws:NPM_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23namenugetapikey_13F9475E: Refreshing state... [id=cdktf-provider-aws:NUGET_API_KEY]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23nameghtoken_3B17187D: Refreshing state... [id=cdktf-provider-aws:GH_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23nametwinepassword_56459168: Refreshing state... [id=cdktf-provider-aws:TWINE_PASSWORD]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderprojectrepo014C3CE2namenpmtoken_CA780E66: Refreshing state... [id=cdktf-provider-project:NPM_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79namenugetapikey_191ADD39: Refreshing state... [id=cdktf-provider-kubernetes:NUGET_API_KEY]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79nametwineusername_3167ABFB: Refreshing state... [id=cdktf-provider-kubernetes:TWINE_USERNAME]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79nametwinepassword_CBAB489F: Refreshing state... [id=cdktf-provider-kubernetes:TWINE_PASSWORD]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79nameghtoken_5AAD8445: Refreshing state... [id=cdktf-provider-kubernetes:GH_TOKEN]
github_team_repository.repos_cdktfproviderproject_managingteam_86F83671: Refreshing state... [id=3949435:cdktf-provider-project]
github_team_repository.repos_cdktfprovideraws_managingteam_FC9AAFD0: Refreshing state... [id=3949435:cdktf-provider-aws]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79namenpmtoken_7B3206A5: Refreshing state... [id=cdktf-provider-kubernetes:NPM_TOKEN]
github_team_repository.repos_cdktfproviderexternal_managingteam_9DD6F017: Refreshing state... [id=3949435:cdktf-provider-external]
github_team_repository.repos_cdktfproviderdocker_managingteam_F33627F0: Refreshing state... [id=3949435:cdktf-provider-docker]
github_team_repository.repos_cdktfprovidergoogle_managingteam_9604098C: Refreshing state... [id=3949435:cdktf-provider-google]
github_team_repository.repos_cdktfproviderrandom_managingteam_94F669F5: Refreshing state... [id=3949435:cdktf-provider-random]
github_team_repository.repos_cdktfproviderdatadog_managingteam_455152F1: Refreshing state... [id=3949435:cdktf-provider-datadog]
github_team_repository.repos_cdktfproviderazurerm_managingteam_C1D890C2: Refreshing state... [id=3949435:cdktf-provider-azurerm]
github_team_repository.repos_cdktfrepositorymanager_managingteam_31E92624: Refreshing state... [id=3949435:cdktf-repository-manager]
github_team_repository.repos_cdktfprovidergithub_managingteam_DD2D4282: Refreshing state... [id=3949435:cdktf-provider-github]
github_team_repository.repos_cdktfprovidernull_managingteam_900A83BC: Refreshing state... [id=3949435:cdktf-provider-null]
github_team_repository.repos_cdktfproviderkubernetes_managingteam_E627D265: Refreshing state... [id=3949435:cdktf-provider-kubernetes]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_team_repository.repos_cdktfrepositorymanager_managingteam_31E92624 has been changed
  ~ resource "github_team_repository" "repos_cdktfrepositorymanager_managingteam_31E92624" {
      ~ etag       = "W/\"9cf09cca3360ad193e3981cf4bd74e204705cfdf147216035ba091322098b8cb\"" -> "W/\"02552854cff48518981c8f107ae4703c7f141145184425a141b0e71f22903245\""
        id         = "3949435:cdktf-repository-manager"
        # (3 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_branch.repos_cdktfprovideraws_main_BB8B3A46 will be created
  + resource "github_branch" "repos_cdktfprovideraws_main_BB8B3A46" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "cdktf-provider-aws"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # github_branch.repos_cdktfproviderazurerm_main_E9DF959A will be created
  + resource "github_branch" "repos_cdktfproviderazurerm_main_E9DF959A" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "cdktf-provider-azurerm"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # github_branch.repos_cdktfproviderdatadog_main_2B75A24A will be created
  + resource "github_branch" "repos_cdktfproviderdatadog_main_2B75A24A" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "cdktf-provider-datadog"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # github_branch.repos_cdktfproviderdocker_main_5EB71D16 will be created
  + resource "github_branch" "repos_cdktfproviderdocker_main_5EB71D16" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "cdktf-provider-docker"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # github_branch.repos_cdktfproviderexternal_main_1DDEB11E will be created
  + resource "github_branch" "repos_cdktfproviderexternal_main_1DDEB11E" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "cdktf-provider-external"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # github_branch.repos_cdktfprovidergithub_main_A270C412 will be created
  + resource "github_branch" "repos_cdktfprovidergithub_main_A270C412" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "cdktf-provider-github"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # github_branch.repos_cdktfprovidergoogle_main_7D767ED8 will be created
  + resource "github_branch" "repos_cdktfprovidergoogle_main_7D767ED8" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "cdktf-provider-google"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # github_branch.repos_cdktfproviderkubernetes_main_6850E4B4 will be created
  + resource "github_branch" "repos_cdktfproviderkubernetes_main_6850E4B4" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "cdktf-provider-kubernetes"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # github_branch.repos_cdktfprovidernull_main_C14AA23B will be created
  + resource "github_branch" "repos_cdktfprovidernull_main_C14AA23B" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "cdktf-provider-null"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # github_branch.repos_cdktfproviderproject_main_AEF72BD4 will be created
  + resource "github_branch" "repos_cdktfproviderproject_main_AEF72BD4" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "cdktf-provider-project"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # github_branch.repos_cdktfproviderrandom_main_835E6FF4 will be created
  + resource "github_branch" "repos_cdktfproviderrandom_main_835E6FF4" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "cdktf-provider-random"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # github_branch.repos_cdktfrepositorymanager_main_E174F075 will be created
  + resource "github_branch" "repos_cdktfrepositorymanager_main_E174F075" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "cdktf-repository-manager"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # github_branch_default.repos_cdktfprovideraws_maindefault_09E12362 will be created
  + resource "github_branch_default" "repos_cdktfprovideraws_maindefault_09E12362" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "cdktf-provider-aws"
    }

  # github_branch_default.repos_cdktfproviderazurerm_maindefault_5EE895CD will be created
  + resource "github_branch_default" "repos_cdktfproviderazurerm_maindefault_5EE895CD" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "cdktf-provider-azurerm"
    }

  # github_branch_default.repos_cdktfproviderdatadog_maindefault_1C6AA206 will be created
  + resource "github_branch_default" "repos_cdktfproviderdatadog_maindefault_1C6AA206" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "cdktf-provider-datadog"
    }

  # github_branch_default.repos_cdktfproviderdocker_maindefault_0FB2B4F0 will be created
  + resource "github_branch_default" "repos_cdktfproviderdocker_maindefault_0FB2B4F0" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "cdktf-provider-docker"
    }

  # github_branch_default.repos_cdktfproviderexternal_maindefault_55D9F80C will be created
  + resource "github_branch_default" "repos_cdktfproviderexternal_maindefault_55D9F80C" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "cdktf-provider-external"
    }

  # github_branch_default.repos_cdktfprovidergithub_maindefault_AD8FB5FB will be created
  + resource "github_branch_default" "repos_cdktfprovidergithub_maindefault_AD8FB5FB" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "cdktf-provider-github"
    }

  # github_branch_default.repos_cdktfprovidergoogle_maindefault_2AE30340 will be created
  + resource "github_branch_default" "repos_cdktfprovidergoogle_maindefault_2AE30340" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "cdktf-provider-google"
    }

  # github_branch_default.repos_cdktfproviderkubernetes_maindefault_DB6A12EB will be created
  + resource "github_branch_default" "repos_cdktfproviderkubernetes_maindefault_DB6A12EB" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "cdktf-provider-kubernetes"
    }

  # github_branch_default.repos_cdktfprovidernull_maindefault_2C60C318 will be created
  + resource "github_branch_default" "repos_cdktfprovidernull_maindefault_2C60C318" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "cdktf-provider-null"
    }

  # github_branch_default.repos_cdktfproviderproject_maindefault_5CEA8AB0 will be created
  + resource "github_branch_default" "repos_cdktfproviderproject_maindefault_5CEA8AB0" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "cdktf-provider-project"
    }

  # github_branch_default.repos_cdktfproviderrandom_maindefault_8D8AA2D0 will be created
  + resource "github_branch_default" "repos_cdktfproviderrandom_maindefault_8D8AA2D0" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "cdktf-provider-random"
    }

  # github_branch_default.repos_cdktfrepositorymanager_maindefault_10A91F96 will be created
  + resource "github_branch_default" "repos_cdktfrepositorymanager_maindefault_10A91F96" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "cdktf-repository-manager"
    }

Plan: 24 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "github-token" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
```

</details>

*Pusher: @skorfmann, Action: `pull_request`, Working Directory: ``, Workflow: `Repository Manager`*